Table of Contents
 Class MatSteelAISC
Namespace
IdeaRS.OpenModel.Material
Assembly
IdeaRS.OpenModel.dll
Material steel AISC
[OpenModelClass("CI.StructModel.Libraries.Material.American.MatSteelASTM,CI.Material", "CI.StructModel.Libraries.Material.IMaterial,CI.BasicTypes", typeof(MatSteel))]
public class MatSteelAISC : MatSteel
Inheritance
object
OpenObject
OpenElementId
Material
MatSteel
MatSteelAISC
Inherited Members
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 fu
Ultimate strength for nominal thickness of the element <= 40mm - fu
public double fu { get; set; }
Property Value
double
 fu40
Ultimate strength for nominal thickness of the element > 40mm and <= 100mm - fu,(>40)
public double fu40 { get; set; }
Property Value
double
 fy
Yield strength for nominal thickness of the element <= 40mm - fy
public double fy { get; set; }
Property Value
double
 fy40
Yield strength for nominal thickness of the element > 40mm and <= 100mm - fy,(>40)
public double fy40 { get; set; }
Property Value
double
 Edit this page